In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("Coffe_sales.csv")

In [3]:
df.head()

,hour_of_day,cash_type,money,coffee_name,Time_of_Day,Weekday,Month_name,Weekdaysort,Monthsort,Date,Time
0,10,card,38.7,Latte,Morning,Fri,Mar,5,3,2024-03-01,10:15:50.520000
1,12,card,38.7,Hot Chocolate,Afternoon,Fri,Mar,5,3,2024-03-01,12:19:22.539000
2,12,card,38.7,Hot Chocolate,Afternoon,Fri,Mar,5,3,2024-03-01,12:20:18.089000
3,13,card,28.9,Americano,Afternoon,Fri,Mar,5,3,2024-03-01,13:46:33.006000
4,13,card,38.7,Latte,Afternoon,Fri,Mar,5,3,2024-03-01,13:48:14.626000

In [4]:
df.shape

(3547, 11)

In [6]:
df.columns.to_list()

['hour_of_day',
 'cash_type',
 'money',
 'coffee_name',
 'Time_of_Day',
 'Weekday',
 'Month_name',
 'Weekdaysort',
 'Monthsort',
 'Date',
 'Time']

In [7]:
df.dtypes

hour_of_day      int64
cash_type       object
money          float64
coffee_name     object
Time_of_Day     object
Weekday         object
Month_name      object
Weekdaysort      int64
Monthsort        int64
Date            object
Time            object
dtype: object

In [8]:
df['cash_type'].value_counts()

cash_type
card    3547
Name: count, dtype: int64

In [9]:
df['coffee_name'].value_counts()

coffee_name
Americano with Milk    809
Latte                  757
Americano              564
Cappuccino             486
Cortado                287
Hot Chocolate          276
Cocoa                  239
Espresso               129
Name: count, dtype: int64

In [10]:
df['Time_of_Day'].value_counts()

Time_of_Day
Afternoon    1205
Morning      1181
Night        1161
Name: count, dtype: int64

In [11]:
# Checking Proportion in value counts
df['Time_of_Day'].value_counts(normalize=True)

Time_of_Day
Afternoon    0.339724
Morning      0.332957
Night        0.327319
Name: proportion, dtype: float64

In [14]:
# Get the series in dataframe format
df['Time_of_Day'].value_counts().to_frame().reset_index()

  Time_of_Day  count
0   Afternoon   1205
1     Morning   1181
2       Night   1161

In [16]:
# Value Count of Weekday
# Value Count of Month_Name

df['Weekday'].value_counts().to_frame().reset_index()

  Weekday  count
0     Tue    572
1     Mon    544
2     Fri    532
3     Thu    510
4     Wed    500
5     Sat    470
6     Sun    419

In [18]:
df['Month_name'].value_counts().to_frame().reset_index()

   Month_name  count
0         Mar    494
1         Oct    426
2         Feb    423
3         Sep    344
4         Aug    272
5         Nov    259
6         Dec    259
7         May    241
8         Jul    237
9         Jun    223
10        Jan    201
11        Apr    168

In [22]:
df['hour_of_day'].value_counts().to_frame().reset_index()

    hour_of_day  count
0            10    328
1            11    283
2            16    278
3             9    242
4            12    241
5            17    237
6            15    236
7             8    235
8            19    229
9            14    225
10           13    225
11           18    218
12           21    195
13           20    169
14           22    113
15            7     88
16            6      5

In [ ]:
# univariate analysis
# bivariate analysis
# trivariate analysis